Repository: ahmedrasar/resumeflow
Catalog: lib/l10n/resumeflow_*.arb
Languages: ar

# showcaseScreenHeaderSeg1
source: Build Your Resume
ar: بناء سيرتك الذاتية

# showcaseScreenHeaderSeg2
source: With AI
ar: باستخدام الذكاء الاصطناعي

# showcaseScreenBody
source: Effortlessly Craft a Professional Resume with Our AI-Powered Builder
ar: قم بإنشاء سيرة ذاتية احترافية بسهولة باستخدام منشئنا المدعوم بالذكاء الاصطناعي

source: Get Started
ar: ابدأ الآن

source: Learn More
ar: تعرف على المزيد

source: How It Works?
ar: كيف يعمل؟

# generateInSimpleSteps
source: Generate Well-Crafted Resume in Simple Steps!
ar: قم بإنشاء سيرة ذاتية متقنة في خطوات بسيطة!

source: Login
ar: تسجيل الدخول

# createCard
source: Choose Your Template
ar: اختر القالب الخاص بك

# createCardBody
source: Start by selecting the color scheme for your resume template. Our single, professionally designed template ensures a clean and consistent look for all users.
ar: ابدأ باختيار نظام الألوان لقالب سيرتك الذاتية. يضمن قالبنا المصمم بشكل احترافي مظهرًا نظيفًا ومتسقًا لجميع المستخدمين.

# updateCard
source: Update Your Information
ar: تحديث معلوماتك

# updateCardBody
source: Enter your personal details, work experience, education, and skills into the provided form. Our AI assists you in filling out each section accurately and effectively.
ar: أدخل بياناتك الشخصية وخبراتك العملية وتعليمك ومهاراتك في النموذج المقدم. يساعدك الذكاء الاصطناعي لدينا في ملء كل قسم بدقة وفعالية.

# shareCard
source: Share Your Resume
ar: شارك سيرتك الذاتية

# shareCardBody
source: After completing your resume, save it securely and generate a shareable link. Easily update your information anytime and share the link with potential employers or download it in a preferred format.
ar: بعد إكمال سيرتك الذاتية، احفظها بأمان وقم بإنشاء رابط قابل للمشاركة. قم بتحديث معلوماتك بسهولة في أي وقت وشارك الرابط مع أصحاب العمل المحتملين أو قم بتنزيله بتنسيق مفضل.

source: Language
ar: اللغة

# systemLanguage
source: Follow System Language
ar: اتبع لغة النظام

# systemTheme
source: Follow System Theme
ar: اتبع ثيم النظام

source: Theme
ar: الثيم

source: Light Theme
ar: الثيم الفاتح

source: Dark Theme
ar: الثيم الداكن

source: Resume
ar: السيرة الذاتية

source: Cover Letter
ar: الخطاب التعريفى

source: Settings
ar: الإعدادات

source: Company Name
ar: اسم الشركة

source: Job Post
ar: اعلان الوظيفة

# applicantName
source: Name
ar: الاسم

source: Address
ar: العنوان

source: Telephone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

# applicantDegree
source: Degree
ar: الدرجة العلمية

# applicantTitle
source: Title
ar: المسمى الوظيقى

source: Experience
ar: الخبرة

source: Skills
ar: المهارات

# generatedCoverLetter
source: Your Generated Cover Letter
ar: الخطاب التعريفى الذي تم إنشاؤه

# empytFieldError
source: Field can not be empty
ar: لا يمكن أن تكون هذة الخانة فارغًا

# serverError
source: Server-side error happend (code: {code})
ar: ({code}) :حدث خطا من جانب السيرفر (كود

source: Create Cover Letter
ar: إنشاء خطاب تعريفى

# companyNameTooltip
source: Enter the full name of the recipient (e.g., hiring manager or recruiter).
ar: أدخل الاسم الكامل للمستلم (مثل مدير التوظيف أو الشركة).

# jobPostTooltip
source: Enter the job post that you want to apply to.
ar: أدخل اعلان او منشور الوظيفة التي تريد التقدم لها.

# applicantNameTooltip
source: Provide your full name as it appears on official documents.
ar: قدم اسمك الكامل كما يظهر في المستندات الرسمية.

# addressTooltip
source: Enter your complete residential address, including city and postal code.
ar: أدخل عنوانك السكني الكامل، بما في ذلك المدينة والرمز البريدي.

# telephoneTooltip
source: Provide your active phone number for communication purposes.
ar: قدم رقم هاتفك النشط لأغراض الاتصال.

# emailTooltip
source: Enter your email address where you can be reached.
ar: أدخل عنوان بريدك الإلكتروني حيث يمكن الوصول إليك.

# applicantDegreeTooltip
source: Mention the highest degree or qualification you've obtained (e.g., Bachelor's in Computer Science).
ar: اذكر أعلى درجة أو مؤهل حصلت عليه (مثل بكالوريوس في علوم الكمبيوتر).

# applicantTitleTooltip
source: State your current job or professional designation (e.g., Project Manager).
ar: اذكر وظيفتك الحالية أو لقبك المهني (مثل مدير مشروع).

# experienceTooltip
source: Summarize your relevant work experience, including years in the field.
ar: لخص خبرتك العملية ذات الصلة، بما في ذلك سنوات العمل في المجال.

# skillsTooltip
source: List the key skills that make you suitable for the role (e.g., JavaScript, problem-solving, leadership).
ar: قم بإدراج المهارات الرئيسية التي تجعلك مناسبًا للدور (مثل JavaScript، حل المشكلات، القيادة).

source: Export to DOCX
ar: تصدير إلى DOCX

source: Close
ar: إغلاق

source: Copy
ar: نسخ

# chooseDownloadDir
source: Choose download directory
ar: اختر مجلد التنزيل
